; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image2 - mode
	infrared0 - mode
	thermograph4 - mode
	spectrograph3 - mode
	infrared1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 spectrograph3)
	(supports instrument3 image2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
)
(:goal (and
	(pointing satellite1 Planet5)
	(have_image Planet5 spectrograph3)
	(have_image Planet6 image2)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 infrared0)
	(have_image Phenomenon12 spectrograph3)
	(have_image Planet13 infrared1)
))

)

; plan
1. (turn_to satellite1 star4 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star4)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon12 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon12)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon12 instrument3 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 10
7. (turn_to satellite0 groundstation0 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 10
8. (take_image satellite1 phenomenon10 instrument3 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 2 of 10
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 10
10. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 2 of 10
11. (turn_to satellite0 planet13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet13)
   goals met: 2 of 10
12. (take_image satellite0 planet13 instrument0 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 3 of 10
13. (turn_to satellite0 star7 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star7)
   goals met: 3 of 10
14. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 4 of 10
15. (turn_to satellite1 phenomenon8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 10
16. (take_image satellite1 phenomenon8 instrument3 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 5 of 10
17. (turn_to satellite1 phenomenon9 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon9)
   goals met: 5 of 10
18. (take_image satellite1 phenomenon9 instrument3 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 6 of 10
19. (turn_to satellite1 planet6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet6)
   goals met: 6 of 10
20. (take_image satellite1 planet6 instrument3 image2)
   added: (have_image planet6 image2)
   goals met: 7 of 10
21. (turn_to satellite1 star11 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star11)
   goals met: 7 of 10
22. (take_image satellite1 star11 instrument3 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 10
23. (turn_to satellite1 planet5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet5)
   goals met: 9 of 10
24. (take_image satellite1 planet5 instrument3 spectrograph3)
   added: (have_image planet5 spectrograph3)
   goals met: 10 of 10
